# Ejercicios Sesión 2

Dentro del mismo servidor de bases de datos, conéctate al esquema classicmodels.

In [2]:
%%sql 
USE classicmodels;

 * mysql://data-09:***@data-09.bedu.org
0 rows affected.

[]

1. Dentro de la tabla employees, obten el número de empleado, apellido y nombre de todos los empleados cuyo nombre empiece con a.

In [3]:
%%sql 
SELECT employeeNumber, lastName, firstName
    FROM employees
    WHERE firstName LIKE 'a%';

 * mysql://data-09:***@data-09.bedu.org
2 rows affected.

[(1143, 'Bow', 'Anthony'), (1611, 'Fixter', 'Andy')]

2. Dentro de la tabla employees, obten el número de empleado, apellido y nombre de todos los empleados cuyo nombre termina con on.

In [4]:
%%sql
SELECT employeeNumber, lastName, firstName
    FROM employees
    WHERE firstName LIKE '%on';

 * mysql://data-09:***@data-09.bedu.org
0 rows affected.

[]

3. Dentro de la tabla employees, obten el número de empleado, apellido y nombre de todos los empleados cuyo nombre incluye la cadena on.

In [5]:
%%sql
SELECT employeeNumber, lastName, firstName
    FROM employees
    WHERE firstName LIKE '%on%';

 * mysql://data-09:***@data-09.bedu.org
2 rows affected.

[(1143, 'Bow', 'Anthony'), (1286, 'Tseng', 'Foon Yue')]

4. Dentro de la tabla employees, obten el número de empleado, apellido y nombre de todos los empleados cuyos nombres tienen tres letras e inician con T y finalizan con m.

In [6]:
%%sql
SELECT employeeNumber, lastName, firstName
    FROM employees
    WHERE firstName LIKE 'T_m';

 * mysql://data-09:***@data-09.bedu.org
1 rows affected.

[(1619, 'King', 'Tom')]

5. Dentro de la tabla employees, obten el número de empleado, apellido y nombre de todos los empleados cuyo nombre no inicia con B.

In [7]:
%%sql
SELECT employeeNumber, lastName, firstName
    FROM employees
    WHERE firstName NOT LIKE 'B%';

 * mysql://data-09:***@data-09.bedu.org
22 rows affected.

[(1002, 'Murphy', 'Diane'),
 (1056, 'Patterson', 'Mary'),
 (1076, 'Firrelli', 'Jeff'),
 (1088, 'Patterson', 'William'),
 (1102, 'Bondur', 'Gerard'),
 (1143, 'Bow', 'Anthony'),
 (1165, 'Jennings', 'Leslie'),
 (1166, 'Thompson', 'Leslie'),
 (1188, 'Firrelli', 'Julie'),
 (1216, 'Patterson', 'Steve'),
 (1286, 'Tseng', 'Foon Yue'),
 (1323, 'Vanauf', 'George'),
 (1337, 'Bondur', 'Loui'),
 (1370, 'Hernandez', 'Gerard'),
 (1401, 'Castillo', 'Pamela'),
 (1501, 'Bott', 'Larry'),
 (1611, 'Fixter', 'Andy'),
 (1612, 'Marsh', 'Peter'),
 (1619, 'King', 'Tom'),
 (1621, 'Nishi', 'Mami'),
 (1625, 'Kato', 'Yoshimi'),
 (1702, 'Gerard', 'Martin')]

6. Dentro de la tabla products, obten el código de producto y nombre de los productos cuyo código incluye la cadena _20.

In [8]:
%%sql
SELECT productCode, productName
    FROM products
    WHERE productCode LIKE '%\_20%';

 * mysql://data-09:***@data-09.bedu.org
5 rows affected.

[('S10_2016', '1996 Moto Guzzi 1100i'),
 ('S24_2000', '1960 BSA Gold Star DBD34'),
 ('S24_2011', '18th century schooner'),
 ('S24_2022', '1938 Cadillac V-16 Presidential Limousine'),
 ('S700_2047', 'HMS Bounty')]

7. Dentro de la tabla orderdetails, obten el total de cada orden.

In [9]:
%%sql
SELECT *, (quantityOrdered * priceEach) totalPrice
    FROM orderdetails
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[(10100, 'S18_1749', 30, Decimal('136.00'), 3, Decimal('4080.00')),
 (10100, 'S18_2248', 50, Decimal('55.09'), 2, Decimal('2754.50')),
 (10100, 'S18_4409', 22, Decimal('75.46'), 4, Decimal('1660.12')),
 (10100, 'S24_3969', 49, Decimal('35.29'), 1, Decimal('1729.21')),
 (10101, 'S18_2325', 25, Decimal('108.06'), 4, Decimal('2701.50')),
 (10101, 'S18_2795', 26, Decimal('167.06'), 1, Decimal('4343.56')),
 (10101, 'S24_1937', 45, Decimal('32.53'), 3, Decimal('1463.85')),
 (10101, 'S24_2022', 46, Decimal('44.35'), 2, Decimal('2040.10')),
 (10102, 'S18_1342', 39, Decimal('95.55'), 2, Decimal('3726.45')),
 (10102, 'S18_1367', 41, Decimal('43.13'), 1, Decimal('1768.33'))]

8. Dentro de la tabla orders obten el número de órdenes por año.

In [10]:
%%sql
SELECT YEAR(orderDate) año, COUNT(*) ordenes
    FROM orders
    GROUP BY año;

 * mysql://data-09:***@data-09.bedu.org
3 rows affected.

[(2003, 111), (2004, 151), (2005, 64)]

9. Obten el apellido y nombre de los empleados cuya oficina está ubicada en USA.

In [11]:
%%sql 
SELECT contactLastName, contactFirstName
    FROM customers
    WHERE country = 'USA'
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[('King', 'Jean'),
 ('Nelson', 'Susan'),
 ('Murphy', 'Julie'),
 ('Lee', 'Kwai'),
 ('Young', 'Jeff'),
 ('Leong', 'Kelvin'),
 ('Hashimoto', 'Juri'),
 ('Franco', 'Keith'),
 ('Tseng', 'Jerry'),
 ('King', 'Julie')]

10. Obten el número de cliente, número de cheque y cantidad del cliente que ha realizado el pago más alto.

In [12]:
%%sql
SELECT @maxAmount := max(amount) FROM payments;
SELECT customerNumber, checkNumber, amount, @maxAmount maxAmount
    FROM payments
    WHERE amount = @maxAmount;

 * mysql://data-09:***@data-09.bedu.org
1 rows affected.
1 rows affected.

[(141, 'JE105477', Decimal('120166.58'), Decimal('120166.58'))]

11. Obten el número de cliente, número de cheque y cantidad de aquellos clientes cuyo pago es más alto que el promedio.

In [13]:
%%sql
SELECT @avgAmount := avg(amount) FROM payments;
SELECT customerNumber, checkNumber, amount
    FROM payments
    WHERE amount > @avgAmount
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
1 rows affected.
10 rows affected.

[(112, 'HQ55022', Decimal('32641.98')),
 (112, 'ND748579', Decimal('33347.88')),
 (114, 'GG31455', Decimal('45864.03')),
 (114, 'MA765515', Decimal('82261.22')),
 (114, 'NR27552', Decimal('44894.74')),
 (119, 'LN373447', Decimal('47924.19')),
 (119, 'NG94694', Decimal('49523.67')),
 (121, 'DB889831', Decimal('50218.95')),
 (121, 'MA302151', Decimal('34638.14')),
 (124, 'AE215433', Decimal('101244.59'))]

12. Obten el nombre de aquellos clientes que no han hecho ninguna orden.

In [14]:
%%sql
SELECT ContactFirstName 
    FROM customers
    WHERE customerNumber NOT IN(SELECT customerNumber FROM orders GROUP BY customerNumber);

 * mysql://data-09:***@data-09.bedu.org
24 rows affected.

[('Zbyszek ',),
 ('Keith',),
 ('Isabel ',),
 ('Brydey',),
 ('Horst ',),
 ('Alejandra ',),
 ('Renate ',),
 ('Peter ',),
 ('Ed',),
 ('Bradley',),
 ('Mel',),
 ('Philip ',),
 ('Patricia ',),
 ('Armand',),
 ('Karin',),
 ('Lino ',),
 ('Braun',),
 ('Rita ',),
 ('Alexander ',),
 ('Sven ',),
 ('Carmen',),
 ('Hanna ',),
 ('Alexander ',),
 ('Raanan',)]

13. Obten el máximo, mínimo y promedio del número de productos en las órdenes de venta.

In [15]:
%%sql
SELECT max(quantityOrdered) 'Número de productos máximo',
        min(quantityOrdered) 'Número de productos mínimo', 
        avg(quantityOrdered) 'Número de productos promedio'
    FROM orderdetails;

 * mysql://data-09:***@data-09.bedu.org
1 rows affected.

[(97, 6, Decimal('35.2190'))]

14. Dentro de la tabla orders, obten el número de órdenes que hay por cada estado.

In [16]:
%%sql
SELECT status estado, count(*) ordenes
    FROM orders
    GROUP BY status;

 * mysql://data-09:***@data-09.bedu.org
6 rows affected.

[('Shipped', 303),
 ('Resolved', 4),
 ('Cancelled', 6),
 ('On Hold', 4),
 ('Disputed', 3),
 ('In Process', 6)]